content/posts/A_brief_history_of_Western_Philosophy_by_Anthony_Kenny_in_2019.md
+++
title = "A brief history of Western Philosophy by Anthony Kenny in 2019"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:33:38-04:00
slug = "A_brief_history_of_Western_Philosophy_by_Anthony_Kenny_in_2019"
draft = false
+++

## 1. Philosophy in its infancy {#1-dot-philosophy-in-its-infancy}


### 1.1 The Milesians {#1-dot-1-the-milesians}


### 1.2 Xenophanes {#1-dot-2-xenophanes}


### 1.3 Heraclitus {#1-dot-3-heraclitus}


### 1.4 The school of Parmenides {#1-dot-4-the-school-of-parmenides}


### 1.5 Empedocles {#1-dot-5-empedocles}


### 1.6 The Atomists {#1-dot-6-the-atomists}


## 2. The Athens of Socrates {#2-dot-the-athens-of-socrates}


### 2.1 The Athenian Empire {#2-dot-1-the-athenian-empire}


### 2.2 Anaxagoras {#2-dot-2-anaxagoras}


### 2.3 The sophists {#2-dot-3-the-sophists}


### 2.4 Socrates {#2-dot-4-socrates}


### 2.5 The <span class="underline"><span class="underline">Euthyphro</span></span> {#2-dot-5-the}


### 2.6 The <span class="underline"><span class="underline">Crito</span></span> {#2-dot-6-the}


### 2.7 The <span class="underline"><span class="underline">Phaedo</span></span> {#2-dot-7-the}


## 3. The philosophy of Plato {#3-dot-the-philosophy-of-plato}


### 3.1 Life and works {#3-dot-1-life-and-works}


### 3.2 The theory of ideas {#3-dot-2-the-theory-of-ideas}


### 3.3 Plato's republic {#3-dot-3-plato-s-republic}


### 3.4 The Theaetetus and the Sophist {#3-dot-4-the-theaetetus-and-the-sophist}


## 4. The system of Artistotle {#4-dot-the-system-of-artistotle}


### 4.1 Plato's pupil, Alexander's teacher {#4-dot-1-plato-s-pupil-alexander-s-teacher}


### 4.2 The foundation of logic {#4-dot-2-the-foundation-of-logic}


### 4.3 The theory of drama {#4-dot-3-the-theory-of-drama}


### 4.4 Moral philosophy: virtue and happiness {#4-dot-4-moral-philosophy-virtue-and-happiness}


### 4.5 Moral philosophy: wisdom and understanding {#4-dot-5-moral-philosophy-wisdom-and-understanding}


### 4.6 Politics {#4-dot-6-politics}


### 4.7 Science and explanation {#4-dot-7-science-and-explanation}


### 4.8 Words and things {#4-dot-8-words-and-things}


### 4.9 Motion and change {#4-dot-9-motion-and-change}


### 4.10 Soul, sense, and intellect {#4-dot-10-soul-sense-and-intellect}


### 4.11 Metaphysics {#4-dot-11-metaphysics}


## 5. Greek philosophy after Aristotle {#5-dot-greek-philosophy-after-aristotle}


### 5.1 The Hellenistic Era {#5-dot-1-the-hellenistic-era}


### 5.2 Epicureanism {#5-dot-2-epicureanism}


### 5.3 Stoicism {#5-dot-3-stoicism}


### 5.4 Scepticism {#5-dot-4-scepticism}


### 5.5 Rome and its empire {#5-dot-5-rome-and-its-empire}


### 5.6 Jesus of Nazareth {#5-dot-6-jesus-of-nazareth}


### 5.7 Christianity and Gnosticism {#5-dot-7-christianity-and-gnosticism}


### 5.8 Neo-Platonism {#5-dot-8-neo-platonism}


## 6. Early Christian philosophy {#6-dot-early-christian-philosophy}


### 6.1 Arianism and Orthodoxy {#6-dot-1-arianism-and-orthodoxy}


### 6.2 The theology of incarnation {#6-dot-2-the-theology-of-incarnation}


### 6.3 The life of Augustine {#6-dot-3-the-life-of-augustine}


### 6.4 The City of God and the Mystery of Grace {#6-dot-4-the-city-of-god-and-the-mystery-of-grace}


### 6.5 Boethius and Philoponus {#6-dot-5-boethius-and-philoponus}


## 7. Early Medieval philosophy {#7-dot-early-medieval-philosophy}


### 7.1 John the Scot {#7-dot-1-john-the-scot}


### 7.2 Alkindi and Avicenna {#7-dot-2-alkindi-and-avicenna}


### 7.3 The Feudal system {#7-dot-3-the-feudal-system}


### 7.4 Saint Anselm {#7-dot-4-saint-anselm}


### 7.5 Abelard and Heloise {#7-dot-5-abelard-and-heloise}


### 7.6 Abelard's logic {#7-dot-6-abelard-s-logic}


### 7.7 Abelard's ethics {#7-dot-7-abelard-s-ethics}


### 7.8 Averroes {#7-dot-8-averroes}


## 8. Philosophy in the Thirteenth century {#8-dot-philosophy-in-the-thirteenth-century}


### 8.1 An age of innovation {#8-dot-1-an-age-of-innovation}


### 8.2 Sain Bonaventure {#8-dot-2-sain-bonaventure}


### 8.3 Thirteenth-Century logic {#8-dot-3-thirteenth-century-logic}


### 8.4 Aquinas' life and works {#8-dot-4-aquinas-life-and-works}


### 8.5 Aquinas' natural theology {#8-dot-5-aquinas-natural-theology}


### 8.6 Matter, form, substance, and accident {#8-dot-6-matter-form-substance-and-accident}


### 8.7 Aquinas on essence and existence {#8-dot-7-aquinas-on-essence-and-existence}


### 8.8 Aquinas' Philosophy of Mind {#8-dot-8-aquinas-philosophy-of-mind}


### 8.9 Aquinas' Moral Philosophy {#8-dot-9-aquinas-moral-philosophy}


## 9. Oxford philosophers {#9-dot-oxford-philosophers}


### 9.1 The Fourteenth-Century University {#9-dot-1-the-fourteenth-century-university}


### 9.2 Duns Scotus {#9-dot-2-duns-scotus}


### 9.3 Ockham's logic of language {#9-dot-3-ockham-s-logic-of-language}


### 9.4 Ockham's political theory {#9-dot-4-ockham-s-political-theory}


### 9.6 The Oxford calculators {#9-dot-6-the-oxford-calculators}


### 9.7 John Wyclif {#9-dot-7-john-wyclif}


## 10. Renaissance philosophy {#10-dot-renaissance-philosophy}


### 10.1 The renaissance {#10-dot-1-the-renaissance}


### 10.2 Free-will: Rome vs. Louvain {#10-dot-2-free-will-rome-vs-dot-louvain}


### 10.3 Renaissance Platonism {#10-dot-3-renaissance-platonism}


### 10.4 Machiavelli {#10-dot-4-machiavelli}


### 10.5 More's Utopia {#10-dot-5-more-s-utopia}


### 10.6 The Reformation {#10-dot-6-the-reformation}


### 10.7 Post-Reformation Philosophy {#10-dot-7-post-reformation-philosophy}


### 10.8 Bruno and Galileo {#10-dot-8-bruno-and-galileo}


### 10.9 Francis Bacon {#10-dot-9-francis-bacon}


## 11. The age of Descartes {#11-dot-the-age-of-descartes}


### 11.1 The wars of religion {#11-dot-1-the-wars-of-religion}


### 11.2The life of Descartes {#11-dot-2the-life-of-descartes}


### 11.3 The doubt and the <span class="underline"><span class="underline">Cogito</span></span> {#11-dot-3-the-doubt-and-the}


### 11.4 The essence of mind {#11-dot-4-the-essence-of-mind}


### 11.5 God, mind, and body {#11-dot-5-god-mind-and-body}


### 11.6 The material world {#11-dot-6-the-material-world}


## 12. English philosophy in the Seventeenth Century {#12-dot-english-philosophy-in-the-seventeenth-century}


### 12.1 The Empiricism of Thomas Hobbes {#12-dot-1-the-empiricism-of-thomas-hobbes}


### 12.2 Hobbes' political philosophy {#12-dot-2-hobbes-political-philosophy}


### 12.3 The political theory of John Locke {#12-dot-3-the-political-theory-of-john-locke}


### 12.4 Locke on ideas and qualities {#12-dot-4-locke-on-ideas-and-qualities}


### 12.5 Substances and persons {#12-dot-5-substances-and-persons}


## 13. Continental philosophy in the age of Louis XIV {#13-dot-continental-philosophy-in-the-age-of-louis-xiv}


### 13.1 Blaise Pascal {#13-dot-1-blaise-pascal}


### 13.2 Spinoza and Malebranche {#13-dot-2-spinoza-and-malebranche}


### 13.3 Leibniz {#13-dot-3-leibniz}


## 14. British philosophy in the Eighteenth century {#14-dot-british-philosophy-in-the-eighteenth-century}


### 14.1 Berkeley {#14-dot-1-berkeley}


### 14.2 Hume's Philosophy of Mind {#14-dot-2-hume-s-philosophy-of-mind}


### 14.3 Hume on causation {#14-dot-3-hume-on-causation}


### 14.4 Reid and Common Sense {#14-dot-4-reid-and-common-sense}


## 15. The Enlightenment {#15-dot-the-enlightenment}


### 15.1 The <span class="underline"><span class="underline">Philosophes</span></span> {#15-dot-1-the}


### 15.2 Rousseau {#15-dot-2-rousseau}


### 15.3 Revolution and romanticism {#15-dot-3-revolution-and-romanticism}


## 16. The critical philosophy of Kant {#16-dot-the-critical-philosophy-of-kant}


### 16.1 Kant's Copernican Revolution {#16-dot-1-kant-s-copernican-revolution}


### 16.2 The Transcendental Aesthetic {#16-dot-2-the-transcendental-aesthetic}


### 16.2 The Transcendental Analytic: The Deduction of the Categories {#16-dot-2-the-transcendental-analytic-the-deduction-of-the-categories}


### 16.3 The Transcendental Dialectic: The Paralogisms of Pure Reason {#16-dot-3-the-transcendental-dialectic-the-paralogisms-of-pure-reason}


### 16.4 The Transcendental Dialectic: The Antinomies of Pure Reason {#16-dot-4-the-transcendental-dialectic-the-antinomies-of-pure-reason}


### 16.5 The Transcendental Dialectic: The Critique of Natural Theology {#16-dot-5-the-transcendental-dialectic-the-critique-of-natural-theology}


### 16.6 Kant's Moral Philosophy {#16-dot-6-kant-s-moral-philosophy}


## 17. German Idealism and Materialism {#17-dot-german-idealism-and-materialism}


### 17.1 Fichte {#17-dot-1-fichte}


### 17.2 Hegel {#17-dot-2-hegel}

<!--list-separator-->

-  The subject matter of logic is ****the Absolute, the totality of reality,**** familiar to us from earlier philosophers as ****Being****. We start from the thesis that the Absolute is pure Being. But pure Being without any qualities is nothing; so we are led to the antithesis ‘The Absolute is nothing’. This thesis and antithesis are overcome by synthesis: <span class="underline"><span class="underline">the union of Being and Unbeing is becoming</span></span>, and so we say ****‘The Absolute is Becoming’.****

<!--list-separator-->

-  Hegel does make use of Aristotle’s definition of God when he describes the Absolute as being the Thought which thinks itself. But it turns out that the self-awareness of the Absolute comes at the end, not at the beginning, of this life-cycle, and it is brought into existence by the philosophical reflection of human beings. It is the history of philosophy which brings the Absolute face to face with itself.


### 17.3 Marx and the Young Hegelians {#17-dot-3-marx-and-the-young-hegelians}

<!--list-separator-->

-  Marx divided the past, present, and future history of the relations of production into six phases: primitive communism, slavery, feudalism, capitalism, socialism, and ultimate communism

<!--list-separator-->

-  He based this conclusion on two economic theories: the labour theory of value, and the theory of surplus value.

<!--list-separator-->

-  Under capitalism, however, prices in the market are determined not by true value, but by supply and demand. The capitalist, who owns the raw material and the means of production, having paid the worker a wage equal to his day’s subsistence, say 1, can often sell the product for many times that sum, say 10. The difference between the subsistence wage and the market price is the surplus value, in this case 9. Under capitalism, no part ofthis surplus value is returned to the worker, it is all pocketed by the employer. The effect is that only one-tenth ofthe labourer’s work is for his own benefit; nine-tenths of it is just to produce profit for the capitalist.


### 17.4 Capitalism and its discontents {#17-dot-4-capitalism-and-its-discontents}


## 18. The Utilitarians {#18-dot-the-utilitarians}


### 18.1 Jeremy Bentham {#18-dot-1-jeremy-bentham}


### 18.2 The Utilitarianism of J.S. Mill {#18-dot-2-the-utilitarianism-of-j-dot-s-dot-mill}


### 18.3 Mill's Logic {#18-dot-3-mill-s-logic}


## 19. Three Nineteenth-Century Philosophers {#19-dot-three-nineteenth-century-philosophers}


### 19.1 Schopenhauer {#19-dot-1-schopenhauer}


### 19.2 Kierkegaard {#19-dot-2-kierkegaard}


### 19.3 Nietzsche {#19-dot-3-nietzsche}


## 20. Three Modern Masters {#20-dot-three-modern-masters}


### 20.1 Charles Darwin {#20-dot-1-charles-darwin}


### 20.2 John Henry Newman {#20-dot-2-john-henry-newman}


### 20.3 Sigmund Freud {#20-dot-3-sigmund-freud}


## 21. Logic and the foundations of mathematics {#21-dot-logic-and-the-foundations-of-mathematics}


### 21.1 Frege's logic {#21-dot-1-frege-s-logic}


### 21.2 Frege's logicism {#21-dot-2-frege-s-logicism}


### 21.3 Frege's philosophy of logic {#21-dot-3-frege-s-philosophy-of-logic}


### 21.4 Russell's paradox {#21-dot-4-russell-s-paradox}


### 21.5 Russell's theory of descriptions {#21-dot-5-russell-s-theory-of-descriptions}


### 21.6 Logical analysis {#21-dot-6-logical-analysis}


## 22. Continental philosophy in the early twentieth century {#22-dot-continental-philosophy-in-the-early-twentieth-century}


### 22.1 Henri Bergson {#22-dot-1-henri-bergson}


### 22.2 Husserl's phenomenology {#22-dot-2-husserl-s-phenomenology}

<!--list-separator-->

-  [Edmund Husserl]({{< relref "Edmund_Husserl" >}})


### 22.3 The existentialism of Heidegger {#22-dot-3-the-existentialism-of-heidegger}


### 22.4 The existentialism of Sartre and de Beauvoir {#22-dot-4-the-existentialism-of-sartre-and-de-beauvoir}


## 23. The philosophy of Wittgenstein {#23-dot-the-philosophy-of-wittgenstein}


### 23.1 <span class="underline"><span class="underline">Tractatus Logico-Philosophicus</span></span> {#23-dot-1}

<!--list-separator-->

-  Its central doctrine is the picture theory of meaning. According to this theory, language consists of propositions which picture the world. Propositions are the perceptible expressions of thoughts, and thoughts are logical pictures of facts; the world is the totality of facts.


### 23.2 Logical positivism {#23-dot-2-logical-positivism}


### 23.3 <span class="underline"><span class="underline">Philosophical investigations</span></span> {#23-dot-3}


## 24. Recent continental philosophy {#24-dot-recent-continental-philosophy}


### 24.1 The Frankfurt School {#24-dot-1-the-frankfurt-school}


### 24.2 Jacques Derrida {#24-dot-2-jacques-derrida}


### 24.3 [Jurgen Habermas]({{< relref "Jurgen_Habermas" >}}) {#24-dot-3-jurgen-habermas--jurgen-habermas-dot-md}


## 25. Recent analytic philosophy {#25-dot-recent-analytic-philosophy}


### 25.1 Elizabeth Anscombe {#25-dot-1-elizabeth-anscombe}


### 25.2 W.V.O. Quine {#25-dot-2-w-dot-v-dot-o-dot-quine}


### 25.3 Donald Davidson {#25-dot-3-donald-davidson}

<!--list-separator-->

-  a satisfactory theory of meaning must give an account of how the meanings of sentences depend upon the meanings of words


### 25.4 Peter Geach {#25-dot-4-peter-geach}


### 25.5 Peter Strawson {#25-dot-5-peter-strawson}


### 25.6 American metaphysics {#25-dot-6-american-metaphysics}


### 25.7 The Cartesian revival {#25-dot-7-the-cartesian-revival}

<!--list-separator-->

-  Philosophers who have been convinced by Wittgenstein see qualia as just the latest example of the ineffable private experiences that the private language argument was supposed to have killed off. But certainly in the United States many philosophers appear comfortable with the idea, and it has been passed on also to neuroscientists, many of whom have thereby become unconscious dualists. Many philosophers and psychologists believe that the task of a scientific theory of the mind is to establish a principle of correlation between the occurrence of mental states and processes and the occurrence of states and processes in the brain. This correlation would only be a possibility if mental events (e.g. thoughts, or flashes of understanding) were them? selves measureable in the way in which physical events are measurable.


### 25.8 Analytical ethics {#25-dot-8-analytical-ethics}


### 25.9 John Rawls {#25-dot-9-john-rawls}


### 25.10 [Richard Rorty]({{< relref "Richard_Rorty" >}}) {#25-dot-10-richard-rorty--richard-rorty-dot-md}

<!--list-separator-->

-  Mainstream, systematic philosophy aims at truth, but there is another form of philosophy that aims at self-formation, which Rorty styles ‘edification’. ****Edification**** is a project of finding new, better, more interesting, more fruitful ways of speaking. Edifying philosophers are sceptical about systematic philosophy.

<!--list-separator-->

-  ‘Great systematic philosophers, like great scientists, build for eternity. Great edifying philosophers destroy for the sake of their own generation.’

<!--list-separator-->

-  one can concede to [Rorty] that Descartes did great damage to philosophy by giving it an epistemological turn without agreeing that the damage is irreparable. It is, in fact, possible to return to the pre-Cartesian, Aristotelian conception of human nature, and it is perfectly arguable that this was what that great edifier Wittgenstein actually achieved.

<!--list-separator-->

-  ‘What has to be overcome is not a difficulty of the understanding, but of the will. The job to be done is really a job on oneself.’
